### Terraform CI Summary

**Format & Style:** ✅ `success`  
**Initialization:** ✅ `success`  
**Validation:** ✅ `success`  
**Plan:** ✅ `success`  

<details>
<summary>Show Terraform Plan</summary>

```
[0m[1mmodule.kube-hetzner.random_password.rancher_bootstrap[0]: Refreshing state... [id=none][0m
[0m[1mmodule.kube-hetzner.hcloud_placement_group.control_plane[0]: Refreshing state... [id=1125823][0m
[0m[1mmodule.kube-hetzner.random_password.k3s_token: Refreshing state... [id=none][0m
[0m[1mmodule.kube-hetzner.data.hcloud_image.microos_x86_snapshot: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.hcloud_placement_group.agent[0]: Refreshing state... [id=1125824][0m
[0m[1mmodule.kube-hetzner.hcloud_ssh_key.k3s[0]: Refreshing state... [id=101162270][0m
[0m[1mmodule.kube-hetzner.hcloud_network.k3s[0]: Refreshing state... [id=11371387][0m
[0m[1mmodule.kube-hetzner.hcloud_firewall.k3s: Refreshing state... [id=2381126][0m
[0m[1mmodule.kube-hetzner.data.hcloud_image.microos_arm_snapshot: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.hcloud_ssh_keys.keys_by_selector[0]: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.github_release.hetzner_ccm[0]: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.github_release.hetzner_csi[0]: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.github_release.hetzner_csi[0]: Read complete after 1s [id=237686054][0m
[0m[1mmodule.kube-hetzner.data.github_release.kured[0]: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.github_release.hetzner_ccm[0]: Read complete after 1s [id=229419124][0m
[0m[1mmodule.kube-hetzner.data.github_release.kured[0]: Read complete after 0s [id=203405526][0m
[0m[1mmodule.kube-hetzner.local_file.kustomization_backup[0]: Refreshing state... [id=ef162be06bb944e4d85518dc5e66750bbcc0e722][0m
[0m[1mmodule.kube-hetzner.data.hcloud_image.microos_x86_snapshot: Read complete after 1s[0m
[0m[1mmodule.kube-hetzner.data.hcloud_ssh_keys.keys_by_selector[0]: Read complete after 1s[0m
[0m[1mmodule.kube-hetzner.data.hcloud_image.microos_arm_snapshot: Read complete after 1s[0m
[0m[1mmodule.kube-hetzner.data.hcloud_network.k3s: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.hcloud_network.k3s: Read complete after 0s [name=kube-baphomet][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.control_plane[0]: Refreshing state... [id=11371387-10.255.0.0/16][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.control_plane[2]: Refreshing state... [id=11371387-10.253.0.0/16][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.control_plane[1]: Refreshing state... [id=11371387-10.254.0.0/16][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.agent[2]: Refreshing state... [id=11371387-10.2.0.0/16][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.agent[1]: Refreshing state... [id=11371387-10.1.0.0/16][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.agent[0]: Refreshing state... [id=11371387-10.0.0.0/16][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].random_string.server: Refreshing state... [id=gwe][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].random_string.identity_file: Refreshing state... [id=uqgn66gq6m2azl4x29kd][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].random_string.server: Refreshing state... [id=idz][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].random_string.identity_file: Refreshing state... [id=fji8u4q38lhh14f2cp4w][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].random_string.identity_file: Refreshing state... [id=738odnfq33zio688pf0p][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].random_string.server: Refreshing state... [id=jbp][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].random_string.identity_file: Refreshing state... [id=u4e4g031nr87jie5tauq][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].random_string.identity_file: Refreshing state... [id=urvougqof1w17cod8tb9][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].random_string.identity_file: Refreshing state... [id=1xhj21b4lvipyug7rk81][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].random_string.server: Refreshing state... [id=qmd][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].random_string.server: Refreshing state... [id=yze][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].random_string.server: Refreshing state... [id=jds][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].data.cloudinit_config.config: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].data.cloudinit_config.config: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].data.cloudinit_config.config: Read complete after 0s [id=1914263343][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].data.cloudinit_config.config: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].data.cloudinit_config.config: Read complete after 0s [id=3502544543][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].data.cloudinit_config.config: Read complete after 0s [id=2757169060][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].hcloud_server.server: Refreshing state... [id=107326370][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].data.cloudinit_config.config: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].hcloud_server.server: Refreshing state... [id=107326368][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].data.cloudinit_config.config: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].hcloud_server.server: Refreshing state... [id=107326369][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].data.cloudinit_config.config: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].data.cloudinit_config.config: Read complete after 0s [id=1687613019][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].data.cloudinit_config.config: Read complete after 0s [id=2493182142][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].data.cloudinit_config.config: Read complete after 0s [id=1146670375][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].hcloud_server.server: Refreshing state... [id=107326367][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].hcloud_server.server: Refreshing state... [id=107326372][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].hcloud_server.server: Refreshing state... [id=107326371][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].null_resource.zram: Refreshing state... [id=591848473262652349][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].null_resource.registries: Refreshing state... [id=6586862468915986867][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].null_resource.zram: Refreshing state... [id=7741602599914835630][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].null_resource.zram: Refreshing state... [id=3801600543361501937][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].null_resource.registries: Refreshing state... [id=4391929139405223724][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].null_resource.registries: Refreshing state... [id=2416683657342555691][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].null_resource.zram: Refreshing state... [id=3100196481487250984][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].null_resource.registries: Refreshing state... [id=2164875135613485730][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].null_resource.zram: Refreshing state... [id=7132025308614390573][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].null_resource.zram: Refreshing state... [id=3454054410525720281][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].null_resource.registries: Refreshing state... [id=1203282651418657247][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].null_resource.registries: Refreshing state... [id=6612949876487880533][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].null_resource.os_upgrade_toggle: Refreshing state... [id=7733738887739391331][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].null_resource.os_upgrade_toggle: Refreshing state... [id=6760703838613828844][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].null_resource.os_upgrade_toggle: Refreshing state... [id=6885564650542048379][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].null_resource.os_upgrade_toggle: Refreshing state... [id=3384418264542912962][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].null_resource.os_upgrade_toggle: Refreshing state... [id=2834111656333834224][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].null_resource.os_upgrade_toggle: Refreshing state... [id=3647724397072278650][0m
[0m[1mmodule.kube-hetzner.null_resource.first_control_plane: Refreshing state... [id=3273526741531178514][0m
[0m[1mmodule.kube-hetzner.null_resource.authentication_config["0-0-control-plane-0"]: Refreshing state... [id=8165931445818439667][0m
[0m[1mmodule.kube-hetzner.null_resource.authentication_config["2-0-control-plane-2"]: Refreshing state... [id=5564173805809968237][0m
[0m[1mmodule.kube-hetzner.null_resource.authentication_config["1-0-control-plane-1"]: Refreshing state... [id=3373234370336836793][0m
[0m[1mmodule.kube-hetzner.null_resource.control_plane_config["0-0-control-plane-0"]: Refreshing state... [id=8177448226794888768][0m
[0m[1mmodule.kube-hetzner.null_resource.control_plane_config["1-0-control-plane-1"]: Refreshing state... [id=6870177516800092743][0m
[0m[1mmodule.kube-hetzner.null_resource.control_plane_config["2-0-control-plane-2"]: Refreshing state... [id=3431820889252721399][0m
[0m[1maws_route53_record.control_plane_dns["cp-3"]: Refreshing state... [id=Z00476003F8RX1KPNHHY4_cp-3.baphomet.cloud_A][0m
[0m[1maws_route53_record.control_plane_dns["cp-1"]: Refreshing state... [id=Z00476003F8RX1KPNHHY4_cp-1.baphomet.cloud_A][0m
[0m[1maws_route53_record.control_plane_dns["cp-2"]: Refreshing state... [id=Z00476003F8RX1KPNHHY4_cp-2.baphomet.cloud_A][0m
[0m[1maws_route53_record.cluster_base_dns_v6: Refreshing state... [id=Z00476003F8RX1KPNHHY4_baphomet.cloud_AAAA][0m
[0m[1maws_route53_record.cluster_base_dns_v4: Refreshing state... [id=Z00476003F8RX1KPNHHY4_baphomet.cloud_A][0m
[0m[1maws_route53_record.cluster_wildcard_dns_v4: Refreshing state... [id=Z00476003F8RX1KPNHHY4_*.baphomet.cloud_A][0m
[0m[1maws_route53_record.cluster_wildcard_dns_v6: Refreshing state... [id=Z00476003F8RX1KPNHHY4_*.baphomet.cloud_AAAA][0m
[0m[1maws_route53_record.rancher_dns_v6: Refreshing state... [id=Z00476003F8RX1KPNHHY4_rancher.baphomet.cloud_AAAA][0m
[0m[1mmodule.kube-hetzner.null_resource.agent_config["0-0-worker-0"]: Refreshing state... [id=6193885406866351365][0m
[0m[1maws_route53_record.rancher_dns_v4: Refreshing state... [id=Z00476003F8RX1KPNHHY4_rancher.baphomet.cloud_A][0m
[0m[1maws_route53_record.agent_dns_v6["worker-2"]: Refreshing state... [id=Z00476003F8RX1KPNHHY4_worker-2.baphomet.cloud_AAAA][0m
[0m[1mmodule.kube-hetzner.null_resource.agent_config["2-0-worker-2"]: Refreshing state... [id=412661880923752022][0m
[0m[1mmodule.kube-hetzner.null_resource.agent_config["1-0-worker-1"]: Refreshing state... [id=7532897043608759869][0m
[0m[1maws_route53_record.agent_dns_v6["worker-1"]: Refreshing state... [id=Z00476003F8RX1KPNHHY4_worker-1.baphomet.cloud_AAAA][0m
[0m[1maws_route53_record.agent_dns_v4["worker-1"]: Refreshing state... [id=Z00476003F8RX1KPNHHY4_worker-1.baphomet.cloud_A][0m
[0m[1maws_route53_record.agent_dns_v4["worker-2"]: Refreshing state... [id=Z00476003F8RX1KPNHHY4_worker-2.baphomet.cloud_A][0m
[0m[1mmodule.kube-hetzner.null_resource.control_planes["0-0-control-plane-0"]: Refreshing state... [id=1017220330221711879][0m
[0m[1mmodule.kube-hetzner.null_resource.control_planes["2-0-control-plane-2"]: Refreshing state... [id=3528773748414705069][0m
[0m[1mmodule.kube-hetzner.null_resource.control_planes["1-0-control-plane-1"]: Refreshing state... [id=7314197384017818506][0m
[0m[1mmodule.kube-hetzner.null_resource.agents["0-0-worker-0"]: Refreshing state... [id=5054957641469632851][0m
[0m[1mmodule.kube-hetzner.null_resource.agents["1-0-worker-1"]: Refreshing state... [id=4974907998152838104][0m
[0m[1mmodule.kube-hetzner.null_resource.agents["2-0-worker-2"]: Refreshing state... [id=2725149939002952482][0m
[0m[1mmodule.kube-hetzner.null_resource.kustomization: Refreshing state... [id=8696473715077894294][0m
[0m[1mmodule.kube-hetzner.ssh_sensitive_resource.kubeconfig: Refreshing state... [id=6635757914691194821][0m
[0m[1mmodule.kube-hetzner.null_resource.kustomization_user["letsencrypt/kustomization.yaml.tpl"]: Refreshing state... [id=3890514957756658408][0m
[0m[1mmodule.kube-hetzner.null_resource.kustomization_user["ingress/ingress.yaml.tpl"]: Refreshing state... [id=7550838995254402501][0m
[0m[1mmodule.kube-hetzner.null_resource.kustomization_user["letsencrypt/letsencrypt.yaml.tpl"]: Refreshing state... [id=9195021189423894384][0m
[0m[1mmodule.kube-hetzner.null_resource.kustomization_user["ingress/kustomization.yaml.tpl"]: Refreshing state... [id=351639819484933969][0m
[0m[1mmodule.kube-hetzner.local_sensitive_file.kubeconfig[0]: Refreshing state... [id=3cf0b326b0dd8ca338c5223d8ab7c40063e61350][0m
[0m[1mmodule.kube-hetzner.null_resource.kustomization_user_deploy[0]: Refreshing state... [id=5068746586288630653][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [31m-[0m destroy[0m

Terraform will perform the following actions:

[1m  # module.kube-hetzner.local_file.kustomization_backup[0][0m will be created
[0m  [32m+[0m[0m resource "local_file" "kustomization_backup" {
      [32m+[0m[0m content              = (sensitive value)
      [32m+[0m[0m content_base64sha256 = (known after apply)
      [32m+[0m[0m content_base64sha512 = (known after apply)
      [32m+[0m[0m content_md5          = (known after apply)
      [32m+[0m[0m content_sha1         = (known after apply)
      [32m+[0m[0m content_sha256       = (known after apply)
      [32m+[0m[0m content_sha512       = (known after apply)
      [32m+[0m[0m directory_permission = "0777"
      [32m+[0m[0m file_permission      = "600"
      [32m+[0m[0m filename             = "kube-baphomet_kustomization_backup.yaml"
      [32m+[0m[0m id                   = (known after apply)
    }

[1m  # module.kube-hetzner.local_sensitive_file.kubeconfig[0][0m will be created
[0m  [32m+[0m[0m resource "local_sensitive_file" "kubeconfig" {
      [32m+[0m[0m content              = (sensitive value)
      [32m+[0m[0m content_base64sha256 = (known after apply)
      [32m+[0m[0m content_base64sha512 = (known after apply)
      [32m+[0m[0m content_md5          = (known after apply)
      [32m+[0m[0m content_sha1         = (known after apply)
      [32m+[0m[0m content_sha256       = (known after apply)
      [32m+[0m[0m content_sha512       = (known after apply)
      [32m+[0m[0m directory_permission = "0700"
      [32m+[0m[0m file_permission      = "600"
      [32m+[0m[0m filename             = "kube-baphomet_kubeconfig.yaml"
      [32m+[0m[0m id                   = (known after apply)
    }

[1m  # module.kube-hetzner.null_resource.kustomization_user["ingress/ingress.yaml.tpl"][0m will be [1m[31mdestroyed[0m
  # (because key ["ingress/ingress.yaml.tpl"] is not in for_each map)
[0m  [31m-[0m[0m resource "null_resource" "kustomization_user" {
      [31m-[0m[0m id       = "7550838995254402501" [90m-> null[0m[0m
      [31m-[0m[0m triggers = {
          [31m-[0m[0m "manifest_sha1" = "cd1eef193fbb0891c919ffec4f9c59b0b6f97041"
        } [90m-> null[0m[0m
    }

[1m  # module.kube-hetzner.null_resource.kustomization_user["ingress/kustomization.yaml.tpl"][0m will be [1m[31mdestroyed[0m
  # (because key ["ingress/kustomization.yaml.tpl"] is not in for_each map)
[0m  [31m-[0m[0m resource "null_resource" "kustomization_user" {
      [31m-[0m[0m id       = "351639819484933969" [90m-> null[0m[0m
      [31m-[0m[0m triggers = {
          [31m-[0m[0m "manifest_sha1" = "a8e51c4d19838b640522815d8c39839049e358a3"
        } [90m-> null[0m[0m
    }

[1m  # module.kube-hetzner.null_resource.kustomization_user["letsencrypt/kustomization.yaml.tpl"][0m will be [1m[31mdestroyed[0m
  # (because key ["letsencrypt/kustomization.yaml.tpl"] is not in for_each map)
[0m  [31m-[0m[0m resource "null_resource" "kustomization_user" {
      [31m-[0m[0m id       = "3890514957756658408" [90m-> null[0m[0m
      [31m-[0m[0m triggers = {
          [31m-[0m[0m "manifest_sha1" = "ddbef9ce3c0ac20fe92b963b77829ce2cc57f43e"
        } [90m-> null[0m[0m
    }

[1m  # module.kube-hetzner.null_resource.kustomization_user["letsencrypt/letsencrypt.yaml.tpl"][0m will be [1m[31mdestroyed[0m
  # (because key ["letsencrypt/letsencrypt.yaml.tpl"] is not in for_each map)
[0m  [31m-[0m[0m resource "null_resource" "kustomization_user" {
      [31m-[0m[0m id       = "9195021189423894384" [90m-> null[0m[0m
      [31m-[0m[0m triggers = {
          [31m-[0m[0m "manifest_sha1" = "fdbb0230f03be7a4ed8056c566a09c5d31c24c10"
        } [90m-> null[0m[0m
    }

[1m  # module.kube-hetzner.null_resource.kustomization_user_deploy[0][0m will be [1m[31mdestroyed[0m
  # (because index [0] is out of range for count)
[0m  [31m-[0m[0m resource "null_resource" "kustomization_user_deploy" {
      [31m-[0m[0m id = "5068746586288630653" [90m-> null[0m[0m
    }

[1mPlan:[0m 2 to add, 0 to change, 5 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>

*Pushed by @muchasxmaracas, Action: `pull_request`*